#include <stdio.h>
int main(void)
{
	int i, j;
	int val;
	
	printf("请输入一个数值，以创造一个正方形空心方框："); 
	scanf("%d", &val);
	
	for (i=1; i<=val; i++)
	{
		printf("*");	
	}
	printf("\n");
	
	for (i=1; i<=val-2; i++)
	{
		printf("*");
		for (j=1; j<=val-2; j++)
		{
			printf(" ");
		}
		printf("*\n");
	}
	
	for (i=1; i<=val; i++)
	{
		printf("*");	
	}
	printf("\n");	
}
/*
——————————————————————————————————————
2020年11月26日 23点58分
结论：
	分成三个部分，先打印一条上边，然后打印中间部分，然后是下边。
例子： 
	请输入一个数值，以创造一个正方形空心方框：15
	***************
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	*             *
	***************
	
	--------------------------------
	Process exited after 2.023 seconds with return value 0
	请按任意键继续. . .
—————————————————————————————————————— 
*/
